app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."user_id" = ?  ORDER BY created_at DESC  [["user_id", 1]]
---
  def index
    if user_signed_in?
      @items = Item.where(:user_id => current_user.id).order("created_at DESC")

INSERT INTO "items" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Taks b"], ["description", "fsdf"], ["user_id", 1], ["created_at", "2016-05-06 15:51:08.218243"], ["updated_at", "2016-05-06 15:51:08.218243"]]
---
  def create
    @item = current_user.items.build(item_params)
    if @item.save

UPDATE "items" SET "completed_at" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["completed_at", "2016-05-07 19:37:08.515883"], ["updated_at", "2016-05-07 19:37:08.518085"], ["id", 4]]
---
  def complete
    @item.update_attribute(:completed_at, Time.now)

UPDATE "items" SET "description" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["description", "Do somvc"], ["updated_at", "2016-05-06 14:20:01.939570"], ["id", 1]]
---
  def update
    if @item.update(item_params)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 4]]
---
    def find_item
      @item = Item.find(params[:id])