app/controllers/items_controller.rb

  def index
    @items = Item.all.order("created_at DESC")
---
SELECT "items".* FROM "items"  ORDER BY created_at DESC